driver-tests/bpelse/benchmark/dynamicAddressingDPLCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <add:EndpointReference xmlns:add="http://schemas.xmlsoap.org/ws/2004/08/addressing">
      <add:Address xmlns:add="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://localhost:18181/Synchronous</add:Address>
      <add:ServiceName xmlns:add="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:ns0="http://localhost/Synchronous/Synchronous" PortName="port1">ns0:service1</add:ServiceName>
    </add:EndpointReference>
  </soapenv:Body>
</soapenv:Envelope>