driver-tests/bpelse/xslt/DoXslTransformJBI/test/deepNode/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:grab="http://j2ee.netbeans.org/wsdl/grabPrice" xmlns:add="http://schemas.xmlsoap.org/ws/2004/08/addressing">
  <soapenv:Body>
    <grab:productInfo>
      <grab:product>?string?</grab:product>
      <grab:EndpointReference>
        <add:Address>?http://www.company.org/cum/sonoras?</add:Address>
        <!--Optional:-->
        <add:ReferenceProperties>
          <!--You may enter ANY elements at this point-->
          <AnyElement/>
        </add:ReferenceProperties>
        <!--Optional:-->
        <add:ReferenceParameters>
          <!--You may enter ANY elements at this point-->
          <AnyElement/>
        </add:ReferenceParameters>
        <!--Optional:-->
        <add:PortType>?qname?</add:PortType>
        <!--Optional:-->
        <add:ServiceName PortName="?string?">?qname?</add:ServiceName>
        <!--You may enter ANY elements at this point-->
        <AnyElement/>
      </grab:EndpointReference>
    </grab:productInfo>
  </soapenv:Body>
</soapenv:Envelope>