driver-tests/bpelse/benchmark/dynamicAddressingDPLCA/test/TestCase2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://schemas.xmlsoap.org/ws/2004/08/addressing">
  <soapenv:Body>
    <add:EndpointReference>
      <add:Address>http://localhost:18181/BacupSynchronous</add:Address>
      <add:ServiceName PortName="port1" xmlns:ns0="http://localhost/Synchronous/Synchronous">ns0:service1</add:ServiceName>
    </add:EndpointReference>
  </soapenv:Body>
</soapenv:Envelope>